Revit 2027 API
DefaultDivideSettings.PathDistance Property
 A default Divided Path distance for a fixed, minimum, or maximum distance layout.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double PathDistance { get; set; }
Public Property PathDistance As Double
	Get
	Set
public:
property double PathDistance {
	double get ();
	void set (double value);
}
member PathDistance : float with get, set
Property Value
Double
See Also
Reference
DefaultDivideSettings Class
Autodesk.Revit.DB Namespace